Revit 2027 API
ParameterTypeId.RebarSystemLayoutRule Property
 "Layout Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemLayoutRule { get; }
Public Shared ReadOnly Property RebarSystemLayoutRule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemLayoutRule {
	ForgeTypeId^ get ();
}
static member RebarSystemLayoutRule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace